import psycopg2
import time
import sys
import stomp
import threading
import datetime
from commons import RandomUtils
from db_tools.postgresql import PG_Client
from mq_tools.amq import Amq_Conn
from mq_tools.amq.Amq_Conn import MessageListener
from mq_tools.amq.Amq_Conn import AmqConnetion



# PG_Client.select('tag_point_record' , None , { 'tagid' : 121 } , None , [ 0 , 1]);
'''
随机查询一个标签
select * 
from tag_info ORDER BY RANDOM() 
LIMIT 1 

'''


# 发送Mq
conn = AmqConnetion();

# conn.startAndConnect();
conn.startAndConnectNotBack();

def newMessageData(tag_info):
    mqMessageData = {};
    mqMessageData['cls'] = "tag"
    mqMessageData['id'] = tag_info['i_id'];
    mqMessageData['layer_name'] = "egms_110"
    mqMessageData['time'] = datetime.datetime.now().strftime('%Y-%m-%d %H:%M:%S')
    mqMessageData['key'] = "coordinate"
    mqMessageData['val'] = "1,-4830"
    return mqMessageData;


for i in range(5000) :
    # tag_info = PG_Client.query('select * from tag_info ORDER BY RANDOM() LIMIT 1 ', None);
    # print(' rows : ', tag_info);
    # message = newMessageData(tag_info);
    nameArr = ["陈宏子", "秦婷婷", "折蓉蓉", "曹丽娜", "李娜", "姜钰", "魏天霞", "王官君", "王红梅", "郭淑慧", "马海娟", "孙洪山", "胡丹丹", "倪辰曦", "胡书琴",
               "冷静", "李剑", "范志坚", "任娟娟", "何圆", "安瑞娟", "汤敏树", "史娟", "王艳红", "姚志奋", "吴巧芬", "陈墨", "张琪", "毛春华", "王丽婧", "曾顺",
               "晏玉屏", "彭玉林", "曾盼丽", "谭艳红", "刘甜甜", "王璨", "刘彬彬", "吴银红", "徐晨曦", "蔡婷", "郑广荣", "周蓓", "陈小艳", "丁欣如", "谢辅仁",
               "张嘉", "李雯婷", "宋玉红", "毛晨霞", "余少虹", "余少华", "周莹", "卢兰凤", "万腾龙", "张博", "何羽衣", "林立", "朱红艳", "李允麒", "魏霖",
               "许超丽", "何柳青", "黄鸿江", "孙婷", "黎锦荣", "谢剑萍", "王峥", "洪欣意", "唐芳", "肖舒", "何元", "杨嘉怡", "张佳婧", "王若峰", "王丹青",
               "胡海峰", "任青", "罗莹", "曹雪", "汤宇", "郑涵", "黎明", "薛丽娜", "肖青", "罗茵", "陈瑞微", "陈逸群", "陈思阳", "李林臻", "刘勇", "周志光",
               "周克涛", "廖靖华", "马慧霞", "胡卫伟", "陈藜文", "张清华", "邓莎", "肖晓新", "曹昆", "罗振炜", "钱敏", "贵奂", "杨诗琪", "李雅文", "唐行轲",
               "周奕", "谭丽", "张小林", "杨玲", "屈鑫燕", "蔡明灼", "薛槐敏", "陈小红", "朱翼", "潘千", "张恒", "谢文婷", "冯瑾娜", "张英", "王琳", "汪海源",
               "孙燕冉", "常小丽", "王燕", "李朝", "李元宵", "马丹丹", "杜美娜", "赵护林", "朱寅竹", "尹明", "徐振方", "罗玉婧", "何朝燕", "张荷", "仇国林",
               "冯敏敏", "俞丽", "李鸾", "张林锋", "薛珊珊", "孙琳", "罗敏", "武彩霞", "高倩", "崔璨", "王敏", "景芳", "张雯雯", "阮浙临", "王晶", "肖风迎",
               "冯超", "郭霞", "李艳茹", "阎慧", "胡毅秉", "郭燕", "陈红娟", "王玉宁", "周宇", "周菊", "贺楠", "刘世晓", "李乔", "吴思锋", "李梓", "黄迎春",
               "全娟", "彭铮", "邓天文", "刘嘉佳", "陈秀春", "陈科生", "刘雪映", "石璞璞", "李青妍", "丘素莉", "邝计嘉", "刘先睿", "陈迪", "肖东菁", "汪佳丽",
               "傅双育", "王聪", "李璇", "马舒滟", "许青云", "徐丹", "张奕", "田野", "彭亚光", "殷夏", "黄欢", "庞琳", "张子腾", "姜春阳", "刘冰若", "万菲",
               "何丽", "刘龙飞", "顾天天", "宣苗", "周彦楠", "朱小玲", "毛雅清", "江皎", "王伊", "黄登高", "王莉", "董润", "谭雪", "董方帅", "黄明光", "李凯生",
               "黄乃康", "贾玲", "陈晓露", "刘艳芳", "刘丽艳", "任黎平", "王盼盼", "杨欢", "张舒婷", "杨芳", "茹然", "许朝亮", "邢洋", "陆欣楠", "刘易", "王文霞",
               "刘佳", "刁海鹏", "杜亚琼", "程玲", "高川", "金鼎", "苏旭", "李永清", "龙慧", "柴扉", "张琳", "董薇", "余婧", "李亦然", "徐歌", "孔维源",
               "冯栋", "汪潇潇", "张文婷", "勘晓妹", "张依弛", "孙榕", "廖丽霞", "解欣", "谭军红", "张玲玲", "傅姁妮", "张润", "郝蓓蓓", "张青梅", "乔亚楠",
               "冯敬宇", "黄莎莎", "潘佼佼", "李欣", "龚旻", "李丹", "陈翔洁", "李刚", "吴思莹", "罗兰君", "李森", "周莹", "严岩", "文妮", "吕昊", "李珏",
               "潘小旋", "赵晓敏", "闫颖慧", "何洁萍", "韩香茹", "徐婷婷", "高彬", "孙巍", "薄坤坤", "刘旭阳", "王思敏", "张蕾", "卜文月", "张媛媛", "王鹏飞",
               "黄颖", "张琼", "姚秋月", "廉雁捷", "周玮", "马杰", "郭佳", "赵淑洁", "李琴", "谢海莲", "刘京", "李晓燕", "王聪", "范亚娟", "徐娟", "张硕",
               "贾绰", "范逊敏", "杨丽", "单雅丽", "谢云生", "韩冬", "庞书娟", "史乃原", "孙雅念", "李旗挺", "李艳婷", "马雁翔", "尹姗姗", "黄鼎", "庞哲",
               "朱佳婧", "张珊珊", "郝思雨", "王鑫", "马健", "叶恒", "杨帆", "闫雪花", "段晓雯", "张子晶", "郑婷婷", "高淑贤", "孟佳", "黄琦", "郭静", "余小娟",
               "贾彩娟", "陈荣锦", "于姝斐", "阮盛婧", "温洁", "李英健", "庞晓瑜", "方娟", "许晓凌", "谢娜", "张锐", "孟竹", "李欣", "张红玲", "张杰", "贾翠晓",
               "巩潇然", "王琴", "杨文田", "韩志保", "宋燕", "张东群", "赵爱香", "赵雪培", "李雪飞", "范召琳", "楚红梅", "魏荣梅", "赵晨", "尚继鹏", "张一珠",
               "申志敏", "殷晓婷", "李慧芳", "贾利利", "刘欣", "杨剑东", "张变英", "苏丹", "邓罕攀", "李焰", "郑玉兰", "李作健", "宁晓蕾", "张志诚", "刘璐",
               "李军林", "陈敏杰", "梁峰", "肖蕾", "李维奇", "喻唯", "王博", "袁丹", "曲芳", "武妹", "宫素香", "刁文洁", "王雪", "范佳慧", "周芸", "刘婷婷",
               "盛文凤", "王雪", "崔丹", "刘颖", "王玉洁", "姜葳", "董英灏", "王侃", "刘琨", "冯超", "宁升椿", "陈光琦", "陈晓晨", "郭欣", "李杨", "徐冬蕾",
               "王华梅", "董达勇", "闫卓琳", "杨靖", "刘丽丽", "杨云", "孙宇", "刘晶", "王永佳", "徐铭潞", "高群", "刘雅真", "曾祥玲", "刘珊珊", "赵鑫", "解丽娟",
               "刘建伟", "陈珂瑾", "周玲玲", "宋宾", "杨思", "魏双艳", "刘永杰", "潘煜晨", "罗宏达", "凌云志", "张文琳", "向可嘉", "卜臻敏", "王文", "陈佳敏",
               "周颖雯", "袁沁茹", "宋明星", "杨季赟", "王颖群", "周娟", "熊辉", "陆轶文", "崔明华", "颜婷", "袁飞", "崔映芬", "赵天湖", "徐磊", "毕凯", "常静娜",
               "李凤", "张茜", "张晶晶", "陆兰兰", "俞旸", "张婷婷", "李昕一", "李娜", "叶紫薇", "傅琦", "李妍", "谢微微", "冬妮", "刘羽扬", "周悠悠", "樊周依",
               "武文嘉", "徐珺", "盛珺", "刘嵩", "梁艳", "于敏", "韩婧", "黄彩萍", "王伟鹏", "曹兵", "李贞", "吴晓成", "江松洁", "鲁玉萍", "周淑枫", "张曼曼",
               "张瑞娟", "戚银燕", "陈芸", "顾鸿兰", "毛玲燕", "徐梦灵", "陈铮", "仲娜娜", "王苑苑", "陈思远", "林倩倩", "何培芬", "步雅芸", "皮金燕", "余姗姗",
               "何兰兰", "范琴英", "陈丹丽", "唐奇", "崔业萍", "王二为", "王莉淳", "孙云云", "袁嫚玲", "杨颜", "郭舒静", "沈雨露", "王立冕", "周灿金", "陈舒斌",
               "朱晓妤", "郑雅颖", "张力甦", "游成敏", "王云玲", "阮薇", "曾培中", "李桢", "林芳", "周倩", "余英姿", "黎菁菁"];

    conn.sendTopic(str(nameArr) , 'testtopic');

# message = newMessageData();
# conn.sendTopic(str(message), 'testtopic');

# conn.sendQueue('zhuangjiesenhahahahahah' , 'hellomq');

'''

conn.setQueueConsumer('hellomq' , MyMsgListener())
conn.setTopicConsumer('hellomqTopic' , MyTopicMsgListener())
class MyMsgListener(MessageListener):
    def on_message(self, headers, message):
        print('---MyMsgListener---on_message----------')

    def on_error(self, headers, message):
        print('---MyMsgListener----on_error---------')

class MyTopicMsgListener(MessageListener):
    def on_message(self, headers, message):
        print('---MyTopicMsgListener---on_message----------')

    def on_error(self, headers, message):
        print('---MyTopicMsgListener----on_error---------')

'''

